In [1]:
from sklearn.datasets import images

In [2]:
images

In [3]:
import pandas as pd

C:\Users\saina\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\saina\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [7]:
data = pd.read_csv('data2.csv')

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
#d = pd.ExcelFile('data3.xlsx')

In [14]:
#Redaing the file in excel is with  command read_excel

In [16]:
d = pd.read_excel('data3.xlsx')

In [17]:
d

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [18]:
pd.read_excel?

In [19]:
d2 = pd.read_excel('data3.xlsx',sheet_name=1)

In [20]:
d2

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [21]:
d3 = pd.read_excel('data3.xlsx',sheet_name="Sheet1")

In [22]:
d3

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [23]:
## we can use read_csv command to read the file and specify which sheet to read either with help of sheet name or sheet index

In [35]:
## We can also read the xlsx file with help of ExcelFile with help of parse method

In [28]:
t =  pd.ExcelFile('data3.xlsx')

In [29]:
t

In [30]:
type(t)

pandas.io.excel._base.ExcelFile

In [44]:
t1=t.parse(1,names = [1,2])

In [45]:
#t1=t.parse

t1

In [46]:
t1

      1        2
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [48]:
#t.parse('data2',names = ['C'], parse_cols = [0] )

ValueError: Number of passed names did not match number of header fields in the file

In [38]:
t1.columns

Index(['Age', 'Salary'], dtype='object')